/**
 # MIT License
 #
 # Copyright (c) 2017 Zeu Fung
 #
 # Permission is hereby granted, free of charge, to any person obtaining a copy
 # of this software and associated documentation files (the "Software"), to deal
 # in the Software without restriction, including without limitation the rights
 # to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 # copies of the Software, and to permit persons to whom the Software is
 # furnished to do so, subject to the following conditions:
 #
 # The above copyright notice and this permission notice shall be included in all
 # copies or substantial portions of the Software.
 #
 # THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 # IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 # FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 # AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 # LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 # OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 # SOFTWARE.
 */

const wemark = require('../../vendor/wemark/wemark.js');
const md = `
## 一、 服务条款的接受与修改

1. 欢迎您使用路几平台服务！各条款标题仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。本协议是用户（下或称“您”）与佛山又四米科技有限公司（下称“路几”）之间的协议（下称“本协议”）。本协议条款构成您（无论个人或者单位）使用路几所提供的服务及其衍生服务之先决条件，通过访问和/或使用路几提供的网站、客户端及其他服务，您表示接受同意本协议的全部条款；如果您不愿意接受本协议的全部条款，您应不使用或主动取消路几的任何服务。

2. 如果您为未满18周岁的自然人，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。未成年人行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可。

3. 路几有权随时对本协议进行修改，您如不同意修改后的内容，您应不使用或主动取消路几的任何服务，否则即视为您接受本协议的修改。

## 二、 服务说明 

适用本协议的路几平台包括但不限于以下服务：

1. 路几网站（www.ruki.pw）及路几移动客户端，含其他任何由路几直接所有或运营的任何网站平台（下称“路几网站”）；

2. 路几直接拥有或运营的客户端包括但不限于PC、平板、手机、电视、机顶盒等全部终端客户端产品平台（下称“路几客户端”）；

3. 路几的其他技术和/或服务（下称“路几其他技术和服务”）。

（以上服务统称为“路几服务”，上述服务所在的平台统称“路几平台”）。

特别排除：路几所提供的服务，均仅限于您在上述平台使用，任何方式将路几内容与平台分离、隐藏的使用行为，均不属于本协议中约定的路几服务。由此引起的一切法律后果由行为人负责，路几将依法追究行为人的法律责任，并停止向您提供服务。

## 三、 使用规则 

1. 用户在申请使用路几服务时，必须向路几提供完整、真实、准确、最新的个人资料。如果上述信息发生变化，用户应及时更改。

2. 用户应妥善保管自己的帐号、密码，不得转让、出借、出租或分享予他人使用。否则路几有权选择根据实际情况暂时封停或永久查封此帐号，当用户的帐号或密码遭到未经授权的使用时，用户应当立即通知路几。但无论如何，所有账号的使用行为均视为用户本人的行为。

3. 用户同意路几在提供服务的过程中以各种方式投放商业性广告或其他任何类型的商业信息（包括但不限于在路几平台的任何位置上投放广告，在用户上传、传播的内容中投放广告），用户同意接受路几通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。

4. 用户在使用路几服务过程中，应遵守相关法律法规。在任何情况下，路几一旦合理地认为用户的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向该用户提供服务。　

5. 禁止用户利用路几平台从事以下行为：
  
    * 制作、上传、复制、传送、传播包含任何反对宪法所确定的基本原则、危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一、破坏民族团结、损害国家荣誉和利益、煽动民族仇恨、民族歧视、破坏民族团结、破坏国家宗教政策、宣扬邪教和封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪、侮辱或者诽谤他人，侵害他人合法权益的等法律、行政法规禁止的内容或其他另人反感的包括但不限于资讯、资料、文字、软件、音乐、照片、图形、信息或其他资料；
    
    * 以任何方式危害未成年人；
    
    * 冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关；
    
    * 伪造标题或以其他方式操控识别资料，使人误认为该内容为路几所传送；
    
    * 将无权传送的内容（例如内部资料、机密资料）进行上载、张贴、发送电子邮件或以其他方式传送；
    
    * 发送任何未获邀约或未经授权的垃圾电邮、广告或宣传资料，或任何其他商业通讯；
    
    * 未经路几明确许可，使用路几平台服务用于任何商业用途或为任何第三方的利益；
    
    * 跟踪或以其他方式骚扰他人；
    
    * 参与任何非法或有可能非法（由路几判断）的活动或交易，包括传授犯罪方法、出售任何非法药物、洗钱活动、诈骗等；
    
    * 赌博、提供赌博数据或透过任何方法诱使他人参与赌博活动；
    
    * 使用或利用路几知识产权（包括我们的商标、品牌、标志、任何其他专有数据或任何网页的布局或设计），或在其他方面侵犯路几任何知识产权（包括试图对路几平台客户端或所使用的软件进行逆向工程）；
    
    * 通过使用任何自动化程序、软件、引擎、网络爬虫、网页分析工具、数据挖掘工具或类似工具，接入路几平台服务、收集或处理通过路几平台服务所提供的内容；
    
    * 对路几平台服务所用的软件进行解编、反向编译或逆向工程，或试图作出上述事项；
    
    * 为破坏或滥用的目的开设多个账户，或恶意上传重复的、无效的大容量数据和信息；
    
    * 利用路几平台进行商业宣传或其他商业行动；
    
    * 其他侵权或违法行为；

6. 就用户违反本协议的行为，路几有权视情节严重程度对该用户做出查封ID，暂时停止、永久禁止其使用路几服务的权利。

7. 路几的后台记录有可能作为用户违反法律法规、违约、侵权的证据，路几可能根据权利人或相关行政机构的要求，披露用户的上述信息以及身份信息，用户同意免除路几因此可能承担的所有法律责任。

## 四、 用户的上传与分享

1. 您可通过路几平台服务在路几平台上传、发布或传输相关内容，包括但不限于文字、软件、程序、图形、图片、声音、音乐、视频、音视频、链接等信息或其他资料（下称“内容”），但您需对此内容承担相关的法律责任。除非有相反证明，路几将您视为您在路几平台上传、发布或传输的内容的版权拥有人或相关权利人。您使用路几平台服务上传、发布或传输内容即代表了您有权且同意在全世界范围内，永久性的、不可撤销的、免费的授予路几：
    
    * 对该内容的存储、使用、发布、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示等权利；
    
    * 将内容的全部或部分编入其他任何形式的作品、媒体、技术中的权利；
    
    * 对您的上传、发布的内容进行商业开发的权利；
    
    * 通过有线或无线网络向您的计算机终端、移动通讯终端（包括但不限于便携式通讯设备如手机和智能平板电脑等）、手持数字影音播放设备、电视接收设备（模拟信号接收设备、数字信号接收设备、数字电视、IPTV、带互联网接入功能的播放设备等）等提供信息的下载、点播、数据传输、移动视频业务（包括但不限于SMS、MMS、WAP、IVR、Streaming、3G、手机视频等无线服务）、及其相关的宣传和推广等服务的权利；
    
    * 以及再授权给其他第三方以上述方式使用的权利。

2. 您理解并保证您在路几平台上传、发布或传输的内容（包括您的账户名称等信息）不含有以下内容：
  
    * 反对宪法确定的基本原则的；
  
    * 危害国家统一、主权和领土完整的；
  
    * 泄露国家秘密、危害国家安全或者损害国家荣誉和利益的；
  
    * 煽动民族仇恨、民族歧视，破坏民族团结，或者侵害民族风俗、习惯的；
  
    * 宣扬邪教、迷信的；
  
    * 扰乱社会秩序，破坏社会稳定的；
  
    * 诱导未成年人违法犯罪和渲染暴力、色情、赌博、恐怖活动的；
  
    * 侮辱或者诽谤他人，侵害公民个人隐私等他人合法权益的；
  
    * 危害社会公德，损害民族优秀文化传统的；
  
    * 有关法律、行政法规和国家规定禁止的其他内容。

3. 路几鼓励各位用户在评论中发表个人的意见和观点，但发表的内容应当不包含涉及种族、宗教信仰、性别、年龄、国籍、残障、性取向等针对特定对象或群体的语言人身攻击、也不允许由以上原因煽动仇恨。评论里发送与视频无关的第三方网址、社交平台、网盘代码等的垃圾广告信息，一经发现路几有权对发垃圾广告的账号永久禁言或作出其他处罚措施。

4. 如果您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。如因此给路几造成不利后果的，您应负责消除影响，并且赔偿路几因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。

## 五、 用户隐私权制度 

1. 用户充分理解并同意用户信息包括用户的隐私信息和非隐私信息两种。隐私信息是指那些能够对用户进行个人辨识的信息，包括用户真实姓名，身份证号，手机号码，IP地址。而非隐私信息是指记录在路几服务器的，用户在使用路几服务时的行为习惯等基本信息和用户隐私信息外的一切普通信息，以及用户同意公开的用户隐私信息。用户充分理解并同意路几主动、被动收集用户信息，也充分理解并同意路几收集非隐私信息的目的是为用户提供尽可能多的个人化网上服务以及为广告商提供一个方便的途径来接触到适合的用户，同时可以发送具有相关性的内容和广告。

2. 路几不会在未经合法用户授权时，公开、编辑或透露用户隐私信息及保存在路几中的非公开内容，除非有下列情况：

    * 有关法律规定或路几合法服务程序规定；
  
    * 在紧急情况下，为维护用户及公众的权益；
  
    * 为维护路几自身的合法权利；
  
    * 其他需要公开、编辑或透露个人信息的情况。

3. 在以下（包括但不限于）几种情况下，用户同意路几使用其用户信息：

    * 在进行促销或抽奖时，路几可能会与赞助商共享用户隐私信息，在这些情况下路几会在发送用户隐私信息之前进行提示，用户可以通过不参与来终止传送过程；
  
    * 用户购买在路几列出的商品时，用户提供的个人信息（例如用户的信用卡号和联系信息）会提供给商家，这些商家会进行数据收集操作，但路几对商家的此种操作不负任何责任；
  
    * 路几会向用户发送关于路几不同产品和服务的信息或者路几认为用户会感兴趣的其他产品和服务。如果用户不希望收到这样的邮件，只需在提供用户信息时或其他任何时候告知即可。另外，路几会竭尽全力保护用户信息，但路几不能确信或保证任何个人信息的安全性，用户须自己承担风险。 

## 六、 第三方链接 

路几服务可能会提供与其他国际互联网网站或资源进行链接。除非另有声明，路几无法对第三方网站之服务进行控制，用户因使用或依赖上述网站或资源所产生的损失或损害，路几不承担任何责任。

## 七、 免责声明

1. 路几对于任何包含、经由或连接、下载或从任何与有关本网络服务所获得的任何内容、信息或广告，不声明或保证其正确性或可靠性；并且对于用户经本服务上的广告、展示而购买、取得的任何产品、信息或资料，路几不负保证责任。用户自行负担使用本服务的风险。

2. 路几有权但无义务，改善或更正路几服务任何部分之任何疏漏、错误。

3. 路几对如下事项不做担保（包括但不限于）：

    * 路几提供的网站、客户端等软件虽然均已经过路几测试，但由于技术本身的局限性，路几不能保证其与其他软硬件、系统完全兼容。如果出现不兼容的情况，用户可将情况报告路几，以获得技术支持。如果无法解决问题，用户可以选择卸载、停止使用路几服务。
  
    * 使用路几服务涉及到Internet服务，可能会受到各个环节不稳定因素的影响。因不可抗力、黑客攻击、系统不稳定、网络中断、用户关机、通信线路等原因，均可能造成路几服务中断或不能满足用户要求的情况。路几不保证服务适合用户的使用要求。
  
    * 由于路几提供的客户端等软件可以通过网络途径下载、传播，因此对于从非路几指定官方站点下载、非路几指定途径获得的路几服务相关软件，路几无法保证其是否感染计算机病毒、是否隐藏有伪装的木马程序等黑客软件，也不承担用户由此遭受的一切直接或间接损害赔偿等法律责任。
  
    * 路几不做出任何与路几服务的安全性、可靠性、及时性和性能有关的担保。
  
    * 路几不保证其提供的任何产品、服务或其他材料符合用户的期望。

4. 用户使用经由路几服务下载或取得的任何资料，其风险由用户自行负担，因该使用而导致用户电脑系统损坏或资料流失，用户应负完全责任。

5. 基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，路几不承担任何直接、间接、附带、衍生或惩罚性的赔偿：

    * 路几服务使用或无法使用；

    * 经由路几服务购买或取得的任何产品、资料或服务；

    * 用户资料遭到未授权的使用或修改；

    * 其他与路几服务相关的事宜。 

6. 用户应妥善保管自己的帐号和密码，加强密码安全性，谨防帐号泄露或被盗。因用户帐号被泄露或被盗而造成的任何损失，如帐号、帐号内财产等丢失、减少的，路几不承担补偿责任。

7. 用户因缺少身份认证或认证信息不真实而导致帐号、帐号内财产等丢失、减少而无法找回的，路几不承担任何法律责任。

## 八、 用户的违约及处理

  * 您在路几平台上发布的内容和信息构成违约的，路几可根据相应规则立即对相应内容和信息进行删除、屏蔽等处理或对您的账户进行暂停使用、查封、注销等处理。

  * 您在路几平台上实施的行为，或虽未在路几平台上实施但对路几平台及其用户产生影响的行为构成违约的，路几可依据相应规则对您的账户执行限制参加活动、中止向您提供部分或全部服务等处理措施。如您的行为构成根本违约的，路几可查封您的账户，终止向您提供服务。

  * 如果您在路几平台上的行为违反相关的法律法规，路几可依法向相关主管机关报告并提交您的使用记录和其他信息。

  * 如您的行为使路几及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿路几及/或其关联公司的上述全部损失。

## 九、服务的变更和终止 

路几有权在任何时候，暂时或永久地变更或终止服务（或任何一部分），无论是否通知用户，路几对服务的变更或终止对用户和任何第三人不承担任何责任。

## 十、法律的适用和管辖 

1. 本条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，本条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力。

2. 如就本协议内容或其执行发生任何争议，应尽量友好协商解决；协商不成时，则争议各方一致同意将发生的争议提交佛山仲裁委员会进行仲裁，仲裁地点为佛山，仲裁语言为中文。仲裁裁决为一裁终局，对各方均有法律约束力。`;

Page({
  data: {
    terms: {},
  },
  onReady: function () {
    wemark.parse(md, this, {
      name: 'terms'
    })
  }
});
